RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_tim.c
/*******************************************************************************
* Function Name  : TIM_OC2Init
* Description    : Initializes the TIMx Channel2 according to the specified
*      parameters in the TIM_OCInitStruct.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure.
* Return         : None
*******************************************************************************/
void TIM_OC2Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;
   
  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CC2E)); 
  tmpccer = TIMx->CCER;
  tmpcr2 =  TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR1;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC2M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC2S));
  tmpccmrx |= (uint16_t)(TIM_OCInitStruct->TIM_OCMode << 8);
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC2P));
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 4);
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 4);
    
  if((TIMx == TIM1) || (TIMx == TIM8) || (TIMx == TIM9)|| (TIMx == TIM10))
  {
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC2NP));
    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCNPolarity << 4);
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC2NE));    
    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputNState << 4);
    
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS2));
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS2N));
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCIdleState << 2);
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCNIdleState << 2);
  }

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR1 = tmpccmrx;
  TIMx->CH2CVR = TIM_OCInitStruct->TIM_Pulse;
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_OC3Init
* Description    : Initializes the TIMx Channel3 according to the specified
*      parameters in the TIM_OCInitStruct.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure.
* Return         : None
*******************************************************************************/
void TIM_OC3Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;
   
  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CC3E));
  tmpccer = TIMx->CCER;
  tmpcr2 =  TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR2;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC3M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC3S));  
  tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC3P));
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 8);
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 8);
    
  if((TIMx == TIM1) || (TIMx == TIM8) || (TIMx == TIM9)|| (TIMx == TIM10))
  {
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC3NP));
    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCNPolarity << 8);
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CC3NE));
    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputNState << 8);
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS3));
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS3N));
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCIdleState << 4);
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCNIdleState << 4);
  }

  TIMx->CTLR2 = tmpcr2;
  TIMx->CHCTLR2 = tmpccmrx;
  TIMx->CH3CVR = TIM_OCInitStruct->TIM_Pulse;
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_OC4Init
* Description    : Initializes the TIMx Channel4 according to the specified
*      parameters in the TIM_OCInitStruct.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure.
* Return         : None
*******************************************************************************/
void TIM_OC4Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CC4E));
  tmpccer = TIMx->CCER;
  tmpcr2 =  TIMx->CTLR2;
  tmpccmrx = TIMx->CHCTLR2;
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_OC4M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CC4S));
  tmpccmrx |= (uint16_t)(TIM_OCInitStruct->TIM_OCMode << 8);
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CC4P));
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 12);
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 12);
    
  if((TIMx == TIM1) || (TIMx == TIM8) || (TIMx == TIM9)|| (TIMx == TIM10))
  {
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_OIS4));
    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCIdleState << 6);
  }

  TIMx->CTLR2 = tmpcr2; 
  TIMx->CHCTLR2 = tmpccmrx;
  TIMx->CH4CVR = TIM_OCInitStruct->TIM_Pulse;
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_ICInit
* Description    : IInitializes the TIM peripheral according to the specified
*      parameters in the TIM_ICInitStruct.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_ICInitStruct: pointer to a TIM_ICInitTypeDef structure.
* Return         : None
*******************************************************************************/
void TIM_ICInit(TIM_TypeDef* TIMx, TIM_ICInitTypeDef* TIM_ICInitStruct)
{
  if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_1)
  {
    TI1_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC1Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
  else if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_2)
  {
    TI2_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC2Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
  else if (TIM_ICInitStruct->TIM_Channel == TIM_Channel_3)
  {
    TI3_Config(TIMx,  TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC3Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
  else
  {
    TI4_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);
    TIM_SetIC4Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
}

