RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_tim.c
/*******************************************************************************
* Function Name  : TIM_Cmd
* Description    :  Enables or disables the specified TIM peripheral.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void TIM_Cmd(TIM_TypeDef* TIMx, FunctionalState NewState)
{ 
  if (NewState != DISABLE)
  {
    TIMx->CTLR1 |= TIM_CEN;
  }
  else
  {
    TIMx->CTLR1 &= (uint16_t)(~((uint16_t)TIM_CEN));
  }
}

/*******************************************************************************
* Function Name  : TIM_CtrlPWMOutputs
* Description    : Enables or disables the TIM peripheral Main Outputs.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void TIM_CtrlPWMOutputs(TIM_TypeDef* TIMx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    TIMx->BDTR |= TIM_MOE;
  }
  else
  {
    TIMx->BDTR &= (uint16_t)(~((uint16_t)TIM_MOE));
  }  
}

/*******************************************************************************
* Function Name  : TIM_ITConfig
* Description    : Enables or disables the specified TIM interrupts.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_IT: specifies the TIM interrupts sources to be enabled or disabled.
*                    TIM_IT_Update: TIM update Interrupt source.
*                    TIM_IT_CC1: TIM Capture Compare 1 Interrupt source.
*                    TIM_IT_CC2: TIM Capture Compare 2 Interrupt source
*                    TIM_IT_CC3: TIM Capture Compare 3 Interrupt source.
*                    TIM_IT_CC4: TIM Capture Compare 4 Interrupt source.
*                    TIM_IT_COM: TIM Commutation Interrupt source.
*                    TIM_IT_Trigger: TIM Trigger Interrupt source.
*                    TIM_IT_Break: TIM Break Interrupt source.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void TIM_ITConfig(TIM_TypeDef* TIMx, uint16_t TIM_IT, FunctionalState NewState)
{  
  if (NewState != DISABLE)
  {
    TIMx->DMAINTENR |= TIM_IT;
  }
  else
  {
    TIMx->DMAINTENR &= (uint16_t)~TIM_IT;
  }
}

/*******************************************************************************
* Function Name  : TIM_GenerateEvent
* Description    : Configures the TIMx event to be generate by software.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_EventSource: specifies the event source.
*                    TIM_EventSource_Update: Timer update Event source.
*                    TIM_EventSource_CC1: Timer Capture Compare 1 Event source.
*                    TIM_EventSource_CC2: Timer Capture Compare 2 Event source.
*                    TIM_EventSource_CC3: Timer Capture Compare 3 Event source.
*                    TIM_EventSource_CC4: Timer Capture Compare 4 Event source.
*                    TIM_EventSource_COM: Timer COM event source.
*                    TIM_EventSource_Trigger: Timer Trigger Event source.
*                    TIM_EventSource_Break: Timer Break event source.
* Return         : None
*******************************************************************************/
void TIM_GenerateEvent(TIM_TypeDef* TIMx, uint16_t TIM_EventSource)
{ 
  TIMx->SWEVGR = TIM_EventSource;
}

/*******************************************************************************
* Function Name  : TIM_DMAConfig
* Description    : Configures the TIMx's DMA interface.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_DMABase: DMA Base address.
*                    TIM_DMABase_CR.
*                    TIM_DMABase_CR2.
*                    TIM_DMABase_SMCR.
*                    TIM_DMABase_DIER.
*                    TIM1_DMABase_SR.
*                    TIM_DMABase_EGR.
*                    TIM_DMABase_CCMR1.
*                    TIM_DMABase_CCMR2.
*                    TIM_DMABase_CCER.
*                    TIM_DMABase_CNT.
*                    TIM_DMABase_PSC.
*                    TIM_DMABase_CCR1.
*                    TIM_DMABase_CCR2.
*                    TIM_DMABase_CCR3.
*                    TIM_DMABase_CCR4.
*                    TIM_DMABase_BDTR.
*                    TIM_DMABase_DCR.
*                  TIM_DMABurstLength: DMA Burst length.
*                    TIM_DMABurstLength_1Transfer.
*                    TIM_DMABurstLength_18Transfers.
* Return         : None
*******************************************************************************/
void TIM_DMAConfig(TIM_TypeDef* TIMx, uint16_t TIM_DMABase, uint16_t TIM_DMABurstLength)
{
  TIMx->DMACFGR = TIM_DMABase | TIM_DMABurstLength;
}

/*******************************************************************************
* Function Name  : TIM_DMACmd
* Description    : Enables or disables the TIMx's DMA Requests.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_DMASource: specifies the DMA Request sources.
*                    TIM_DMA_Update: TIM update Interrupt source.
*                    TIM_DMA_CC1: TIM Capture Compare 1 DMA source.
*                    TIM_DMA_CC2: TIM Capture Compare 2 DMA source.
*                    TIM_DMA_CC3: TIM Capture Compare 3 DMA source.
*                    TIM_DMA_CC4: TIM Capture Compare 4 DMA source.
*                    TIM_DMA_COM: TIM Commutation DMA source.
*                    TIM_DMA_Trigger: TIM Trigger DMA source.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void TIM_DMACmd(TIM_TypeDef* TIMx, uint16_t TIM_DMASource, FunctionalState NewState)
{ 
  if (NewState != DISABLE)
  {
    TIMx->DMAINTENR |= TIM_DMASource; 
  }
  else
  {
    TIMx->DMAINTENR &= (uint16_t)~TIM_DMASource;
  }
}

