RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_tim.c
/*******************************************************************************
* Function Name  : TIM_InternalClockConfig
* Description    : Configures the TIMx internal Clock.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
* Return         : None
*******************************************************************************/
void TIM_InternalClockConfig(TIM_TypeDef* TIMx)
{
  TIMx->SMCFGR &=  (uint16_t)(~((uint16_t)TIM_SMS));
}

/*******************************************************************************
* Function Name  : TIM_ITRxExternalClockConfig
* Description    : Configures the TIMx Internal Trigger as External Clock.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_InputTriggerSource: Trigger source.
*                    TIM_TS_ITR0: Internal Trigger 0.
*                    TIM_TS_ITR1: Internal Trigger 1.
*                    TIM_TS_ITR2: Internal Trigger 2.
*                    TIM_TS_ITR3: Internal Trigger 3.
* Return         : None
*******************************************************************************/
void TIM_ITRxExternalClockConfig(TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource)
{
  TIM_SelectInputTrigger(TIMx, TIM_InputTriggerSource);
  TIMx->SMCFGR |= TIM_SlaveMode_External1;
}

/*******************************************************************************
* Function Name  : TIM_TIxExternalClockConfig
* Description    : Configures the TIMx Trigger as External Clock.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_TIxExternalCLKSource: Trigger source.
*                    TIM_TIxExternalCLK1Source_TI1ED: TI1 Edge Detector.
*                    TIM_TIxExternalCLK1Source_TI1: Filtered Timer Input 1.
*                    TIM_TIxExternalCLK1Source_TI2: Filtered Timer Input 2.
*                  TIM_ICPolarity: specifies the TIx Polarity.
*                    TIM_ICPolarity_Rising.
*                    TIM_ICPolarity_Falling.
*                    TIM_DMA_COM: TIM Commutation DMA source.
*                    TIM_DMA_Trigger: TIM Trigger DMA source.
*                  ICFilter : specifies the filter value.
*                    This parameter must be a value between 0x0 and 0xF.
* Return         : None
*******************************************************************************/
void TIM_TIxExternalClockConfig(TIM_TypeDef* TIMx, uint16_t TIM_TIxExternalCLKSource,
                                uint16_t TIM_ICPolarity, uint16_t ICFilter)
{
  if (TIM_TIxExternalCLKSource == TIM_TIxExternalCLK1Source_TI2)
  {
    TI2_Config(TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI, ICFilter);
  }
  else
  {
    TI1_Config(TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI, ICFilter);
  }

  TIM_SelectInputTrigger(TIMx, TIM_TIxExternalCLKSource);
  TIMx->SMCFGR |= TIM_SlaveMode_External1;
}

/*******************************************************************************
* Function Name  : TIM_ETRClockMode1Config
* Description    : Configures the External clock Mode1.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
*                    TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
*                    TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
*                    TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
*                    TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
*                  TIM_ExtTRGPolarity: The external Trigger Polarity.
*                    TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
*                    TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
*                  ExtTRGFilter: External Trigger Filter.
*                    This parameter must be a value between 0x0 and 0xF.
* Return         : None
*******************************************************************************/
void TIM_ETRClockMode1Config(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                             uint16_t ExtTRGFilter)
{
  uint16_t tmpsmcr = 0;

  TIM_ETRConfig(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);
  tmpsmcr = TIMx->SMCFGR;
  tmpsmcr &= (uint16_t)(~((uint16_t)TIM_SMS));
  tmpsmcr |= TIM_SlaveMode_External1;
  tmpsmcr &= (uint16_t)(~((uint16_t)TIM_TS));
  tmpsmcr |= TIM_TS_ETRF;
  TIMx->SMCFGR = tmpsmcr;
}

/*******************************************************************************
* Function Name  : TIM_ETRClockMode2Config
* Description    : Configures the External clock Mode2.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
*                    TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
*                    TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
*                    TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
*                    TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
*                  TIM_ExtTRGPolarity: The external Trigger Polarity.
*                    TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
*                    TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
*                  ExtTRGFilter: External Trigger Filter.
*                    This parameter must be a value between 0x0 and 0xF.
* Return         : None
*******************************************************************************/
void TIM_ETRClockMode2Config(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, 
                             uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter)
{
  TIM_ETRConfig(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);
  TIMx->SMCFGR |= TIM_ECE;
}

/*******************************************************************************
* Function Name  : TIM_ETRConfig
* Description    : Configures the TIMx External Trigger (ETR).
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
*                    TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
*                    TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
*                    TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
*                    TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
*                  TIM_ExtTRGPolarity: The external Trigger Polarity.
*                    TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
*                    TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
*                  ExtTRGFilter: External Trigger Filter.
*                    This parameter must be a value between 0x0 and 0xF.
* Return         : None
*******************************************************************************/
void TIM_ETRConfig(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                   uint16_t ExtTRGFilter)
{
  uint16_t tmpsmcr = 0;

  tmpsmcr = TIMx->SMCFGR;
  tmpsmcr &= SMCFGR_ETR_Mask;
  tmpsmcr |= (uint16_t)(TIM_ExtTRGPrescaler | (uint16_t)(TIM_ExtTRGPolarity | (uint16_t)(ExtTRGFilter << (uint16_t)8)));
  TIMx->SMCFGR = tmpsmcr;
}

