RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_tim.c
/*******************************************************************************
* Function Name  : TIM_PrescalerConfig
* Description    : Configures the TIMx Prescaler.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  Prescaler: specifies the Prescaler Register value.
*                  TIM_PSCReloadMode: specifies the TIM Prescaler Reload mode.
*                    TIM_PSCReloadMode: specifies the TIM Prescaler Reload mode.
*                    TIM_PSCReloadMode_Update: The Prescaler is loaded at the update event.
*                    TIM_PSCReloadMode_Immediate: The Prescaler is loaded immediately.
* Return         : None
*******************************************************************************/
void TIM_PrescalerConfig(TIM_TypeDef* TIMx, uint16_t Prescaler, uint16_t TIM_PSCReloadMode)
{
  TIMx->PSC = Prescaler;
  TIMx->SWEVGR = TIM_PSCReloadMode;
}

/*******************************************************************************
* Function Name  : TIM_CounterModeConfig
* Description    : Specifies the TIMx Counter Mode to be used.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_CounterMode: specifies the Counter Mode to be used.
*                    TIM_CounterMode_Up: TIM Up Counting Mode.
*                    TIM_CounterMode_Down: TIM Down Counting Mode.
*                    TIM_CounterMode_CenterAligned1: TIM Center Aligned Mode1.
*                    TIM_CounterMode_CenterAligned2: TIM Center Aligned Mode2.
*                    TIM_CounterMode_CenterAligned3: TIM Center Aligned Mode3.
* Return         : None
*******************************************************************************/
void TIM_CounterModeConfig(TIM_TypeDef* TIMx, uint16_t TIM_CounterMode)
{
  uint16_t tmpcr1 = 0;

  tmpcr1 = TIMx->CTLR1;
  tmpcr1 &= (uint16_t)(~((uint16_t)(TIM_DIR | TIM_CMS)));
  tmpcr1 |= TIM_CounterMode;
  TIMx->CTLR1 = tmpcr1;
}

/*******************************************************************************
* Function Name  : TIM_SelectInputTrigger
* Description    : Selects the Input Trigger source.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_InputTriggerSource: The Input Trigger source.
*                    TIM_TS_ITR0: Internal Trigger 0.
*                    TIM_TS_ITR1: Internal Trigger 1.
*                    TIM_TS_ITR2: Internal Trigger 2.
*                    TIM_TS_ITR3: Internal Trigger 3.
*                    TIM_TS_TI1F_ED: TI1 Edge Detector.
*                    TIM_TS_TI1FP1: Filtered Timer Input 1.
*                    TIM_TS_TI2FP2: Filtered Timer Input 2.
*                    TIM_TS_ETRF: External Trigger input.
* Return         : None
*******************************************************************************/
void TIM_SelectInputTrigger(TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource)
{
  uint16_t tmpsmcr = 0;

  tmpsmcr = TIMx->SMCFGR;
  tmpsmcr &= (uint16_t)(~((uint16_t)TIM_TS));
  tmpsmcr |= TIM_InputTriggerSource;
  TIMx->SMCFGR = tmpsmcr;
}

/*******************************************************************************
* Function Name  : TIM_EncoderInterfaceConfig
* Description    : Configures the TIMx Encoder Interface.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_EncoderMode: specifies the TIMx Encoder Mode.
*                    TIM_EncoderMode_TI1: Counter counts on TI1FP1 edge depending 
*      on TI2FP2 level.
*                    TIM_EncoderMode_TI2: Counter counts on TI2FP2 edge depending
*      on TI1FP1 level.
*                    TIM_EncoderMode_TI12: Counter counts on both TI1FP1 and 
*      TI2FP2 edges depending.
*                  TIM_IC1Polarity: specifies the IC1 Polarity.
*                    TIM_ICPolarity_Falling: IC Falling edge.
*                    TTIM_ICPolarity_Rising: IC Rising edge.
*                  TIM_IC2Polarity: specifies the IC2 Polarity.
*                    TIM_ICPolarity_Falling: IC Falling edge.
*                    TIM_ICPolarity_Rising: IC Rising edge.
* Return         : None
*******************************************************************************/
void TIM_EncoderInterfaceConfig(TIM_TypeDef* TIMx, uint16_t TIM_EncoderMode,
                                uint16_t TIM_IC1Polarity, uint16_t TIM_IC2Polarity)
{
  uint16_t tmpsmcr = 0;
  uint16_t tmpccmr1 = 0;
  uint16_t tmpccer = 0;
    
  tmpsmcr = TIMx->SMCFGR;
  tmpccmr1 = TIMx->CHCTLR1;
  tmpccer = TIMx->CCER;
  tmpsmcr &= (uint16_t)(~((uint16_t)TIM_SMS));
  tmpsmcr |= TIM_EncoderMode;
  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)TIM_CC1S)) & (uint16_t)(~((uint16_t)TIM_CC2S)));
  tmpccmr1 |= TIM_CC1S_0 | TIM_CC2S_0;
  tmpccer &= (uint16_t)(((uint16_t)~((uint16_t)TIM_CC1P)) & ((uint16_t)~((uint16_t)TIM_CC2P)));
  tmpccer |= (uint16_t)(TIM_IC1Polarity | (uint16_t)(TIM_IC2Polarity << (uint16_t)4)); 
  TIMx->SMCFGR = tmpsmcr;
  TIMx->CHCTLR1 = tmpccmr1;
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_ForcedOC1Config
* Description    : Forces the TIMx output 1 waveform to active or inactive level.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_ForcedAction: specifies the forced Action to be set to the 
*      output waveform.
*                    TIM_ForcedAction_Active: Force active level on OC1REF. 
*                    TIM_ForcedAction_InActive: Force inactive level on OC1REF.
* Return         : None
*******************************************************************************/
void TIM_ForcedOC1Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction)
{
  uint16_t tmpccmr1 = 0;

  tmpccmr1 = TIMx->CHCTLR1;
  tmpccmr1 &= (uint16_t)~((uint16_t)TIM_OC1M);
  tmpccmr1 |= TIM_ForcedAction;
  TIMx->CHCTLR1 = tmpccmr1;
}

/*******************************************************************************
* Function Name  : TIM_ForcedOC2Config
* Description    : Forces the TIMx output 2 waveform to active or inactive level.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_ForcedAction: specifies the forced Action to be set to the 
*      output waveform.
*                    TIM_ForcedAction_Active: Force active level on OC2REF. 
*                    TIM_ForcedAction_InActive: Force inactive level on OC2REF.
* Return         : None
*******************************************************************************/
void TIM_ForcedOC2Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction)
{
  uint16_t tmpccmr1 = 0;

  tmpccmr1 = TIMx->CHCTLR1;
  tmpccmr1 &= (uint16_t)~((uint16_t)TIM_OC2M);
  tmpccmr1 |= (uint16_t)(TIM_ForcedAction << 8);
  TIMx->CHCTLR1 = tmpccmr1;
}

