RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_tim.c
  tmpccmr2 = TIMx->CHCTLR2;
  tmpccmr2 &= (uint16_t)~((uint16_t)TIM_OC3PE);
  tmpccmr2 |= TIM_OCPreload;
  TIMx->CHCTLR2 = tmpccmr2;
}

/*******************************************************************************
* Function Name  : TIM_OC4PreloadConfig
* Description    : Enables or disables the TIMx peripheral Preload register on CCR4.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCPreload: new state of the TIMx peripheral Preload register.
*                    TIM_OCPreload_Enable.
*                    TIM_OCPreload_Disable.
* Return         : None
*******************************************************************************/
void TIM_OC4PreloadConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPreload)
{
  uint16_t tmpccmr2 = 0;

  tmpccmr2 = TIMx->CHCTLR2;
  tmpccmr2 &= (uint16_t)~((uint16_t)TIM_OC4PE);
  tmpccmr2 |= (uint16_t)(TIM_OCPreload << 8);
  TIMx->CHCTLR2 = tmpccmr2;
}

/*******************************************************************************
* Function Name  : TIM_OC1FastConfig
* Description    : Configures the TIMx Output Compare 1 Fast feature.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
*                    TIM_OCFast_Enable: TIM output compare fast enable.
*                    TIM_OCFast_Disable: TIM output compare fast disable.
* Return         : None
*******************************************************************************/
void TIM_OC1FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast)
{
  uint16_t tmpccmr1 = 0;

  tmpccmr1 = TIMx->CHCTLR1;
  tmpccmr1 &= (uint16_t)~((uint16_t)TIM_OC1FE);
  tmpccmr1 |= TIM_OCFast;
  TIMx->CHCTLR1 = tmpccmr1;
}

/*******************************************************************************
* Function Name  : TIM_OC2FastConfig
* Description    : Configures the TIMx Output Compare 2 Fast feature.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
*                    TIM_OCFast_Enable: TIM output compare fast enable.
*                    TIM_OCFast_Disable: TIM output compare fast disable.
* Return         : None
*******************************************************************************/
void TIM_OC2FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast)
{
  uint16_t tmpccmr1 = 0;

  tmpccmr1 = TIMx->CHCTLR1;
  tmpccmr1 &= (uint16_t)~((uint16_t)TIM_OC2FE);
  tmpccmr1 |= (uint16_t)(TIM_OCFast << 8);
  TIMx->CHCTLR1 = tmpccmr1;
}

/*******************************************************************************
* Function Name  : TIM_OC3FastConfig
* Description    : Configures the TIMx Output Compare 3 Fast feature.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
*                    TIM_OCFast_Enable: TIM output compare fast enable.
*                    TIM_OCFast_Disable: TIM output compare fast disable.
* Return         : None
*******************************************************************************/
void TIM_OC3FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast)
{
  uint16_t tmpccmr2 = 0;

  tmpccmr2 = TIMx->CHCTLR2;
  tmpccmr2 &= (uint16_t)~((uint16_t)TIM_OC3FE);
  tmpccmr2 |= TIM_OCFast;	
  TIMx->CHCTLR2 = tmpccmr2;
}

/*******************************************************************************
* Function Name  : TIM_OC4FastConfig
* Description    : Configures the TIMx Output Compare 4 Fast feature.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
*                    TIM_OCFast_Enable: TIM output compare fast enable.
*                    TIM_OCFast_Disable: TIM output compare fast disable.
* Return         : None
*******************************************************************************/
void TIM_OC4FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast)
{
  uint16_t tmpccmr2 = 0;

  tmpccmr2 = TIMx->CHCTLR2;
  tmpccmr2 &= (uint16_t)~((uint16_t)TIM_OC4FE);
  tmpccmr2 |= (uint16_t)(TIM_OCFast << 8);
  TIMx->CHCTLR2 = tmpccmr2;
}

/*******************************************************************************
* Function Name  : TIM_ClearOC1Ref
* Description    : Clears or safeguards the OCREF1 signal on an external event.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
*                    TIM_OCClear_Enable: TIM Output clear enable.
*                    TIM_OCClear_Disable: TIM Output clear disable.
* Return         : None
*******************************************************************************/
void TIM_ClearOC1Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear)
{
  uint16_t tmpccmr1 = 0;

  tmpccmr1 = TIMx->CHCTLR1;
  tmpccmr1 &= (uint16_t)~((uint16_t)TIM_OC1CE);
  tmpccmr1 |= TIM_OCClear;
  TIMx->CHCTLR1 = tmpccmr1;
}

/*******************************************************************************
* Function Name  : TIM_ClearOC2Ref
* Description    : Clears or safeguards the OCREF2 signal on an external event.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
*                    TIM_OCClear_Enable: TIM Output clear enable.
*                    TIM_OCClear_Disable: TIM Output clear disable.
* Return         : None
*******************************************************************************/
void TIM_ClearOC2Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear)
{
  uint16_t tmpccmr1 = 0;

  tmpccmr1 = TIMx->CHCTLR1;
  tmpccmr1 &= (uint16_t)~((uint16_t)TIM_OC2CE);
  tmpccmr1 |= (uint16_t)(TIM_OCClear << 8);
  TIMx->CHCTLR1 = tmpccmr1;
}

/*******************************************************************************
* Function Name  : TIM_ClearOC3Ref
* Description    : Clears or safeguards the OCREF3 signal on an external event.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
*                    TIM_OCClear_Enable: TIM Output clear enable.
*                    TIM_OCClear_Disable: TIM Output clear disable.
* Return         : None
*******************************************************************************/
void TIM_ClearOC3Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear)
{
  uint16_t tmpccmr2 = 0;

