RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_tim.c
  tmpccmr2 = TIMx->CHCTLR2;
  tmpccmr2 &= (uint16_t)~((uint16_t)TIM_OC3CE);
  tmpccmr2 |= TIM_OCClear;
  TIMx->CHCTLR2 = tmpccmr2;
}

/*******************************************************************************
* Function Name  : TIM_ClearOC4Ref
* Description    : Clears or safeguards the OCREF4 signal on an external event.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
*                    TIM_OCClear_Enable: TIM Output clear enable.
*                    TIM_OCClear_Disable: TIM Output clear disable.
* Return         : None
*******************************************************************************/
void TIM_ClearOC4Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear)
{
  uint16_t tmpccmr2 = 0;

  tmpccmr2 = TIMx->CHCTLR2;
  tmpccmr2 &= (uint16_t)~((uint16_t)TIM_OC4CE);
  tmpccmr2 |= (uint16_t)(TIM_OCClear << 8);
  TIMx->CHCTLR2 = tmpccmr2;
}

/*******************************************************************************
* Function Name  : TIM_OC1PolarityConfig
* Description    : Configures the TIMx channel 1 polarity.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCPolarity: specifies the OC1 Polarity.
*                    TIM_OCPolarity_High: Output Compare active high.
*                    TIM_OCPolarity_Low: Output Compare active low.
* Return         : None
*******************************************************************************/
void TIM_OC1PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity)
{
  uint16_t tmpccer = 0;

  tmpccer = TIMx->CCER;
  tmpccer &= (uint16_t)~((uint16_t)TIM_CC1P);
  tmpccer |= TIM_OCPolarity;
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_OC1NPolarityConfig
* Description    : Configures the TIMx channel 1 polarity.
* Input          : TIMx: where x can be 1 to select the TIM peripheral.
*                  TIM_OCNPolarity: specifies the OC1N Polarity.
*                    TIM_OCNPolarity_High: Output Compare active high.
*                    TIM_OCNPolarity_Low: Output Compare active low.
* Return         : None
*******************************************************************************/
void TIM_OC1NPolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity)
{
  uint16_t tmpccer = 0;
  
  tmpccer = TIMx->CCER;
  tmpccer &= (uint16_t)~((uint16_t)TIM_CC1NP);
  tmpccer |= TIM_OCNPolarity;
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_OC2PolarityConfig
* Description    : Configures the TIMx channel 2 polarity.
* Input          : TIMx: where x can be 1 to 4 to select the TIM peripheral.
*                  TIM_OCPolarity: specifies the OC2 Polarity.
*                    TIM_OCPolarity_High: Output Compare active high.
*                    TIM_OCPolarity_Low: Output Compare active low.
* Return         : None
*******************************************************************************/
void TIM_OC2PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity)
{
  uint16_t tmpccer = 0;

  tmpccer = TIMx->CCER;
  tmpccer &= (uint16_t)~((uint16_t)TIM_CC2P);
  tmpccer |= (uint16_t)(TIM_OCPolarity << 4);
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_OC2NPolarityConfig
* Description    : Configures the TIMx Channel 2N polarity.
* Input          : TIMx: where x can be 1 to select the TIM peripheral.
*                  TIM_OCNPolarity: specifies the OC2N Polarity.
*                    TIM_OCNPolarity_High: Output Compare active high.
*                    TIM_OCNPolarity_Low: Output Compare active low.
* Return         : None
*******************************************************************************/
void TIM_OC2NPolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity)
{
  uint16_t tmpccer = 0;
  
  tmpccer = TIMx->CCER;
  tmpccer &= (uint16_t)~((uint16_t)TIM_CC2NP);
  tmpccer |= (uint16_t)(TIM_OCNPolarity << 4);
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_OC3PolarityConfig
* Description    : Configures the TIMx Channel 3 polarity.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_OCPolarity: specifies the OC3 Polarity.
*                    TIM_OCPolarity_High: Output Compare active high.
*                    TIM_OCPolarity_Low: Output Compare active low.
* Return         : None
*******************************************************************************/
void TIM_OC3PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity)
{
  uint16_t tmpccer = 0;

  tmpccer = TIMx->CCER;
  tmpccer &= (uint16_t)~((uint16_t)TIM_CC3P);
  tmpccer |= (uint16_t)(TIM_OCPolarity << 8);
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_OC3NPolarityConfig
* Description    : Configures the TIMx Channel 3N polarity.
* Input          : TIMx: where x can be 1 to select the TIM peripheral.
*                  TIM_OCNPolarity: specifies the OC2N Polarity.
*                    TIM_OCNPolarity_High: Output Compare active high.
*                    TIM_OCNPolarity_Low: Output Compare active low.
* Return         : None
*******************************************************************************/
void TIM_OC3NPolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity)
{
  uint16_t tmpccer = 0;
    
  tmpccer = TIMx->CCER;
  tmpccer &= (uint16_t)~((uint16_t)TIM_CC3NP);
  tmpccer |= (uint16_t)(TIM_OCNPolarity << 8);
  TIMx->CCER = tmpccer;
}

/*******************************************************************************
* Function Name  : TIM_OC4PolarityConfig
* Description    : Configures the TIMx channel 4 polarity.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_OCPolarity: specifies the OC4 Polarity.
*                    TIM_OCPolarity_High: Output Compare active high.
*                    TIM_OCPolarity_Low: Output Compare active low.
* Return         : None
*******************************************************************************/
void TIM_OC4PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity)
{
  uint16_t tmpccer = 0;

  tmpccer = TIMx->CCER;
  tmpccer &= (uint16_t)~((uint16_t)TIM_CC4P);
  tmpccer |= (uint16_t)(TIM_OCPolarity << 12);
  TIMx->CCER = tmpccer;
}

