RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_tim.c
/*******************************************************************************
* Function Name  : TIM_SelectOutputTrigger
* Description    : Selects the TIMx Trigger Output Mode.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_TRGOSource: specifies the Trigger Output source.
*                    TIM_TRGOSource_Reset:  The UG bit in the TIM_EGR register is 
*      used as the trigger output (TRGO).
*                    TIM_TRGOSource_Enable: The Counter Enable CEN is used as the
*      trigger output (TRGO).
*                    TIM_TRGOSource_Update: The update event is selected as the 
*      trigger output (TRGO).
*                    TIM_TRGOSource_OC1: The trigger output sends a positive pulse 
*      when the CC1IF flag is to be set, as soon as a capture or compare match occurs (TRGO).
*                    TIM_TRGOSource_OC1Ref: OC1REF signal is used as the trigger output (TRGO).
*                    TIM_TRGOSource_OC2Ref: OC2REF signal is used as the trigger output (TRGO).
*                    TIM_TRGOSource_OC3Ref: OC3REF signal is used as the trigger output (TRGO).
*                    TIM_TRGOSource_OC4Ref: OC4REF signal is used as the trigger output (TRGO).
* Return         : None
*******************************************************************************/
void TIM_SelectOutputTrigger(TIM_TypeDef* TIMx, uint16_t TIM_TRGOSource)
{
  TIMx->CTLR2 &= (uint16_t)~((uint16_t)TIM_MMS);
  TIMx->CTLR2 |=  TIM_TRGOSource;
}

/*******************************************************************************
* Function Name  : TIM_SelectSlaveMode
* Description    : Selects the TIMx Slave Mode.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_SlaveMode: specifies the Timer Slave Mode.
*                    TIM_SlaveMode_Reset: Rising edge of the selected trigger
*      signal (TRGI) re-initializes.
*                    TIM_SlaveMode_Gated: The counter clock is enabled when the 
*      trigger signal (TRGI) is high.
*                    TIM_SlaveMode_Trigger:   The counter starts at a rising edge
*      of the trigger TRGI.
*                    TIM_SlaveMode_External1: Rising edges of the selected trigger
*      (TRGI) clock the counter.
* Return         : None
*******************************************************************************/
void TIM_SelectSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_SlaveMode)
{
  TIMx->SMCFGR &= (uint16_t)~((uint16_t)TIM_SMS);
  TIMx->SMCFGR |= TIM_SlaveMode;
}

/*******************************************************************************
* Function Name  : TIM_SelectMasterSlaveMode
* Description    : Sets or Resets the TIMx Master/Slave Mode.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_MasterSlaveMode: specifies the Timer Master Slave Mode.
*                    TIM_MasterSlaveMode_Enable: synchronization between the current 
*      timer and its slaves (through TRGO).
*                    TIM_MasterSlaveMode_Disable: No action.
* Return         : None
*******************************************************************************/
void TIM_SelectMasterSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_MasterSlaveMode)
{
  TIMx->SMCFGR &= (uint16_t)~((uint16_t)TIM_MSM);  
  TIMx->SMCFGR |= TIM_MasterSlaveMode;
}

/*******************************************************************************
* Function Name  : TIM_SetCounter
* Description    : Sets the TIMx Counter Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Counter: specifies the Counter register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCounter(TIM_TypeDef* TIMx, uint16_t Counter)
{
  TIMx->CNT = Counter;
}

/*******************************************************************************
* Function Name  : TIM_SetAutoreload
* Description    : Sets the TIMx Autoreload Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Autoreload: specifies the Autoreload register new value.
* Return         : None
*******************************************************************************/
void TIM_SetAutoreload(TIM_TypeDef* TIMx, uint16_t Autoreload)
{
  TIMx->ATRLR = Autoreload;
}

/*******************************************************************************
* Function Name  : TIM_SetCompare1
* Description    : Sets the TIMx Capture Compare1 Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Compare1: specifies the Capture Compare1 register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCompare1(TIM_TypeDef* TIMx, uint16_t Compare1)
{
  TIMx->CH1CVR = Compare1;
}

/*******************************************************************************
* Function Name  : TIM_SetCompare2
* Description    : Sets the TIMx Capture Compare2 Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Compare2: specifies the Capture Compare2 register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCompare2(TIM_TypeDef* TIMx, uint16_t Compare2)
{
  TIMx->CH2CVR = Compare2;
}

/*******************************************************************************
* Function Name  : TIM_SetCompare3
* Description    : Sets the TIMx Capture Compare3 Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Compare3: specifies the Capture Compare3 register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCompare3(TIM_TypeDef* TIMx, uint16_t Compare3)
{
  TIMx->CH3CVR = Compare3;
}

/*******************************************************************************
* Function Name  : TIM_SetCompare4
* Description    : Sets the TIMx Capture Compare4 Register value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  Compare4: specifies the Capture Compare4 register new value.
* Return         : None
*******************************************************************************/
void TIM_SetCompare4(TIM_TypeDef* TIMx, uint16_t Compare4)
{
  TIMx->CH4CVR = Compare4;
}

