RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_tim.c
/*******************************************************************************
* Function Name  : TIM_SetIC1Prescaler
* Description    : Sets the TIMx Input Capture 1 prescaler.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_ICPSC: specifies the Input Capture1 prescaler new value.
*                    TIM_ICPSC_DIV1: no prescaler.                
*                    TIM_ICPSC_DIV2: capture is done once every 2 events.
*                    TIM_ICPSC_DIV4: capture is done once every 4 events.
*                    TIM_ICPSC_DIV8: capture is done once every 8 events.
* Return         : None
*******************************************************************************/
void TIM_SetIC1Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{
  TIMx->CHCTLR1 &= (uint16_t)~((uint16_t)TIM_IC1PSC);
  TIMx->CHCTLR1 |= TIM_ICPSC;
}

/*******************************************************************************
* Function Name  : TIM_SetIC2Prescaler
* Description    : Sets the TIMx Input Capture 2 prescaler.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_ICPSC: specifies the Input Capture1 prescaler new value.
*                    TIM_ICPSC_DIV1: no prescaler.                
*                    TIM_ICPSC_DIV2: capture is done once every 2 events.
*                    TIM_ICPSC_DIV4: capture is done once every 4 events.
*                    TIM_ICPSC_DIV8: capture is done once every 8 events.
* Return         : None
*******************************************************************************/
void TIM_SetIC2Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{
  TIMx->CHCTLR1 &= (uint16_t)~((uint16_t)TIM_IC2PSC);
  TIMx->CHCTLR1 |= (uint16_t)(TIM_ICPSC << 8);
}

/*******************************************************************************
* Function Name  : TIM_SetIC3Prescaler
* Description    : Sets the TIMx Input Capture 3 prescaler.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_ICPSC: specifies the Input Capture1 prescaler new value.
*                    TIM_ICPSC_DIV1: no prescaler.                
*                    TIM_ICPSC_DIV2: capture is done once every 2 events.
*                    TIM_ICPSC_DIV4: capture is done once every 4 events.
*                    TIM_ICPSC_DIV8: capture is done once every 8 events.
* Return         : None
*******************************************************************************/
void TIM_SetIC3Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{
  TIMx->CHCTLR2 &= (uint16_t)~((uint16_t)TIM_IC3PSC);
  TIMx->CHCTLR2 |= TIM_ICPSC;
}

/*******************************************************************************
* Function Name  : TIM_SetIC4Prescaler
* Description    : Sets the TIMx Input Capture 4 prescaler.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_ICPSC: specifies the Input Capture1 prescaler new value.
*                    TIM_ICPSC_DIV1: no prescaler.                
*                    TIM_ICPSC_DIV2: capture is done once every 2 events.
*                    TIM_ICPSC_DIV4: capture is done once every 4 events.
*                    TIM_ICPSC_DIV8: capture is done once every 8 events.
* Return         : None
*******************************************************************************/
void TIM_SetIC4Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{  
  TIMx->CHCTLR2 &= (uint16_t)~((uint16_t)TIM_IC4PSC);
  TIMx->CHCTLR2 |= (uint16_t)(TIM_ICPSC << 8);
}

/*******************************************************************************
* Function Name  : TIM_SetClockDivision
* Description    : Sets the TIMx Clock Division value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_CKD: specifies the clock division value.
*                    TIM_CKD_DIV1: TDTS = Tck_tim.              
*                    TIM_CKD_DIV2: TDTS = 2*Tck_tim.
*                    TIM_CKD_DIV4: TDTS = 4*Tck_tim.
* Return         : None
*******************************************************************************/
void TIM_SetClockDivision(TIM_TypeDef* TIMx, uint16_t TIM_CKD)
{
  TIMx->CTLR1 &= (uint16_t)~((uint16_t)TIM_CTLR1_CKD);
  TIMx->CTLR1 |= TIM_CKD;
}

/*******************************************************************************
* Function Name  : TIM_GetCapture1
* Description    : Gets the TIMx Input Capture 1 value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CH1CVR: Capture Compare 1 Register value.                  
*******************************************************************************/
uint16_t TIM_GetCapture1(TIM_TypeDef* TIMx)
{
  return TIMx->CH1CVR;
}

/*******************************************************************************
* Function Name  : TIM_GetCapture2
* Description    : Gets the TIMx Input Capture 1 value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CH2CVR: Capture Compare 2 Register value.                  
*******************************************************************************/
uint16_t TIM_GetCapture2(TIM_TypeDef* TIMx)
{
  return TIMx->CH2CVR;
}

/*******************************************************************************
* Function Name  : TIM_GetCapture3
* Description    : Gets the TIMx Input Capture 1 value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CH3CVR: Capture Compare 3 Register value.                  
*******************************************************************************/
uint16_t TIM_GetCapture3(TIM_TypeDef* TIMx)
{
  return TIMx->CH3CVR;
}

/*******************************************************************************
* Function Name  : TIM_GetCapture4
* Description    : Gets the TIMx Input Capture 1 value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CH4CVR: Capture Compare 4 Register value.                  
*******************************************************************************/
uint16_t TIM_GetCapture4(TIM_TypeDef* TIMx)
{
  return TIMx->CH4CVR;
}

