RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_tim.c
/*******************************************************************************
* Function Name  : TIM_GetCounter
* Description    : Gets the TIMx Counter value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->CNT: Counter Register value.                  
*******************************************************************************/
uint16_t TIM_GetCounter(TIM_TypeDef* TIMx)
{
  return TIMx->CNT;
}

/*******************************************************************************
* Function Name  : TIM_GetPrescaler
* Description    : Gets the TIMx Prescaler value.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
* Return         : TIMx->PSC: Prescaler Register value.                  
*******************************************************************************/
uint16_t TIM_GetPrescaler(TIM_TypeDef* TIMx)
{
  return TIMx->PSC;
}

/*******************************************************************************
* Function Name  : TIM_GetFlagStatus
* Description    : Checks whether the specified TIM flag is set or not.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_FLAG: specifies the flag to check.
*                    TIM_FLAG_Update: TIM update Flag.               
*                    TIM_FLAG_CC1: TIM Capture Compare 1 Flag.
*                    TIM_FLAG_CC2: TIM Capture Compare 2 Flag.
*                    TIM_FLAG_CC3: TIM Capture Compare 3 Flag.
*                    TIM_FLAG_CC4: TIM Capture Compare 4 Flag.
*                    TIM_FLAG_COM: TIM Commutation Flag.
*                    TIM_FLAG_Trigger: TIM Trigger Flag.
*                    TIM_FLAG_Break: TIM Break Flag.
*                    TIM_FLAG_CC1OF: TIM Capture Compare 1 overcapture Flag.
*                    TIM_FLAG_CC2OF: TIM Capture Compare 2 overcapture Flag. 
*                    TIM_FLAG_CC3OF: TIM Capture Compare 3 overcapture Flag.
*                    TIM_FLAG_CC4OF: TIM Capture Compare 4 overcapture Flag.
* Return         : bitstatus: SET or RESET.
*******************************************************************************/
FlagStatus TIM_GetFlagStatus(TIM_TypeDef* TIMx, uint16_t TIM_FLAG)
{ 
  ITStatus bitstatus = RESET;  
  
  if ((TIMx->INTFR & TIM_FLAG) != (uint16_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
	
  return bitstatus;
}

/*******************************************************************************
* Function Name  : TIM_ClearFlag
* Description    : Clears the TIMx's pending flags.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_FLAG: specifies the flag bit to clear.
*                    TIM_FLAG_Update: TIM update Flag.               
*                    TIM_FLAG_CC1: TIM Capture Compare 1 Flag.
*                    TIM_FLAG_CC2: TIM Capture Compare 2 Flag.
*                    TIM_FLAG_CC3: TIM Capture Compare 3 Flag.
*                    TIM_FLAG_CC4: TIM Capture Compare 4 Flag.
*                    TIM_FLAG_COM: TIM Commutation Flag.
*                    TIM_FLAG_Trigger: TIM Trigger Flag.
*                    TIM_FLAG_Break: TIM Break Flag.
*                    TIM_FLAG_CC1OF: TIM Capture Compare 1 overcapture Flag.
*                    TIM_FLAG_CC2OF: TIM Capture Compare 2 overcapture Flag. 
*                    TIM_FLAG_CC3OF: TIM Capture Compare 3 overcapture Flag.
*                    TIM_FLAG_CC4OF: TIM Capture Compare 4 overcapture Flag.
* Return         : None
*******************************************************************************/
void TIM_ClearFlag(TIM_TypeDef* TIMx, uint16_t TIM_FLAG)
{  
  TIMx->INTFR = (uint16_t)~TIM_FLAG;
}

/*******************************************************************************
* Function Name  : TIM_GetITStatus
* Description    : Checks whether the TIM interrupt has occurred or not.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_IT: specifies the TIM interrupt source to check.
*                    TIM_IT_Update: TIM update Interrupt source.               
*                    TIM_IT_CC1: TIM Capture Compare 1 Interrupt source.
*                    TIM_IT_CC2: TIM Capture Compare 2 Interrupt source.
*                    TIM_IT_CC3: TIM Capture Compare 3 Interrupt source.
*                    TIM_IT_CC4: TIM Capture Compare 4 Interrupt source.
*                    TIM_IT_COM: TIM Commutation Interrupt source.
*                    TIM_IT_Trigger: TIM Trigger Interrupt source.
*                    TIM_IT_Break: TIM Break Interrupt source.
* Return         : bitstatus: SET or RESET.
*******************************************************************************/
ITStatus TIM_GetITStatus(TIM_TypeDef* TIMx, uint16_t TIM_IT)
{
  ITStatus bitstatus = RESET;  
  uint16_t itstatus = 0x0, itenable = 0x0;
   
  itstatus = TIMx->INTFR & TIM_IT;
  
  itenable = TIMx->DMAINTENR & TIM_IT;
  if ((itstatus != (uint16_t)RESET) && (itenable != (uint16_t)RESET))
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
	
  return bitstatus;
}

/*******************************************************************************
* Function Name  : TIM_ClearITPendingBit
* Description    : Clears the TIMx's interrupt pending bits.
* Input          : TIMx: where x can be 1 to 4 select the TIM peripheral.
*                  TIM_IT: specifies the pending bit to clear.
*                    TIM_IT_Update: TIM update Interrupt source.               
*                    TIM_IT_CC1: TIM Capture Compare 1 Interrupt source.
*                    TIM_IT_CC2: TIM Capture Compare 2 Interrupt source.
*                    TIM_IT_CC3: TIM Capture Compare 3 Interrupt source.
*                    TIM_IT_CC4: TIM Capture Compare 4 Interrupt source.
*                    TIM_IT_COM: TIM Commutation Interrupt source.
*                    TIM_IT_Trigger: TIM Trigger Interrupt source.
*                    TIM_IT_Break: TIM Break Interrupt source.
* Return         : None
*******************************************************************************/
void TIM_ClearITPendingBit(TIM_TypeDef* TIMx, uint16_t TIM_IT)
{
  TIMx->INTFR = (uint16_t)~TIM_IT;
}

